Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: རི་དགས་དེ་དག་གིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་རི་དགས་སུ་སྐྱེས་ནས།
en: What actions did the deer take that ripened into their births as deer,

source: འདི་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ། མི་མཉེས་པར་མ་བགྱིས་ལགས།
en: and that they pleased the Blessed One and did not displease him?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་འདི་དག་ཐམས་ཅད་རབ་ཏུ་བྱུང་སྟེ།
en: “All of them went forth in the teaching of the totally and completely awakened Buddha Kāśyapa,” the Blessed One explained.

source: དགེ་སློང་འཐབ་ཀྲོལ་ཅན་ཁ་མི་མཁས་པ་ཤ་སྟག་ཏུ་གྱུར་ཏེ། དགེ་སློང་དག་ལ་དེར་དེ་རྣམས་ཀྱིས་གདོལ་པ་ཞེས་བྱ་བའི་ཚིག་བརྗོད་དོ། །
en: “As monks they were nothing but quarrelsome, and lacking discernment they called many other monks low class.

source: ཁ་ཅིག་གིས་དུད་འགྲོ་ཞེས་བྱ་བའི་ཚིག་བརྗོད་དེ།
en: Others among them called them animals.

source: གང་དག་གིས་དུད་འགྲོ་ཞེས་བྱ་བའི་ཚིག་བརྗོད་པ་དེ་དག་ནི་དུད་འགྲོར་སྐྱེས་སོ། །
en: Those who called them animals took rebirth as animals.

source: གང་དག་གིས་གདོལ་པ་ཞེས་བྱ་བའི་ཚིག་བརྗོད་པ་དེ་དག་ནི་གདོལ་པར་སྐྱེས་སོ། །
en: Those who called them low class were born as persons of low class.

source: དེ་དག་གིས་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས།
en: After that they practiced pure conduct all their lives,

source: དབང་པོ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེས་ནི་ད་ལྟར་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ།། །།
en: their faculties ripened, and now they have been liberated.”

source: གོང་མ་སྲེག་ཅེས་བྱ་བ་ནི།
en: The Partridge

source: བཅོམ་ལྡན་འདས་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། ཚོང་པ་ལྔ་བརྒྱ་དང་། སྤྲང་པོ་ལྔ་བརྒྱ་དང་། ཐབས་ཅིག་ཏུ་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ལས། ནགས་ཁྲོད་ཅིག་ཏུ་ལམ་ཕྱུང་སྟེ
en: Once, as the Blessed One was traveling through the countryside with a saṅgha of 1,250 monks, as well as with five hundred merchants and five hundred beggars, they cleared a path in the forest.

source: བཅོམ་ལྡན་འདས་གཤེགས་པའི་ཚེ། ནགས་ཁྲོད་དེའི་ནང་གི་གནས་སུ་མེ་ཆེན་པོ་འབར་ནས། དེས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དག་འཇིགས་ཤིང་སྐྲག་པར་གྱུར་ཏེ།
en: After the Blessed One had passed through the forest, a great fire began to blaze there, terrifying many. They shouted,

source: བདག་ཅག་ནི་ཚིག་ཟིན་ནོ། །
en: “We’re as good as burned!

source: བདག་ཅག་ནི་འཚོ་བར་འགྱུར་བའི་སྐབས་མེད་དོ་སྙམ་མོ། །
en: There’s no way we’ll survive!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དག་འཇིགས་ཤིང་སྐྲག་པར་གཟིགས་སོ། །
en: The Blessed One saw that many had become terrified,

source: གཟིགས་ནས་ཀྱང་འགྲོན་པོ་དེ་རྣམས་ཀྱི་མདུན་ལོགས་སུ་གཤེགས་ནས། ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: and he approached the travelers and spoke in verse, saying:

source: སངས་རྒྱས་ཀུན་གྱི་སྟོབས་གང་དང་། །དགྲ་བཅོམ་རྣམས་ཀྱི་སྟོབས་གང་དང་། །སངས་རྒྱས་དཀོན་མཆོག་གཟི་བརྗིད་ཀྱིས། །མེ་ཁྱོད་ལམ་ནི་དབྱེ་བར་གྱིས། །
en: “May the strength of all the buddhas, May the strength possessed by the arhats, May the light of the Buddha-Jewel Make this pathway free from fire.

source: སངས་རྒྱས་ཀུན་གྱི་སྟོབས་གང་དང་། །དགྲ་བཅོམ་རྣམས་ཀྱི་སྟོབས་གང་དང་། །དམ་ཆོས་དཀོན་མཆོག་གཟི་བརྗིད་ཀྱིས། །མེ་ཁྱོད་ལམ་ནི་དབྱེ་བར་གྱིས། །
en: “May the strength of all the buddhas, May the strength possessed by the arhats, May the light of the Dharma-Jewel Make this pathway free from fire.

source: སངས་རྒྱས་ཀུན་གྱི་སྟོབས་གང་དང་། །དགྲ་བཅོམ་རྣམས་ཀྱི་སྟོབས་གང་དང་། །དགེ་འདུན་དཀོན་མཆོག་གཟི་བརྗིད་ཀྱིས། །མེ་ཁྱོད་ལམ་ནི་དབྱེ་བར་གྱིས། །
en: “May the strength of all the buddhas, May the strength possessed by the arhats, May the light of the Saṅgha-Jewel Make this pathway free from fire.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་གསུངས་མ་ཐག་ཏུ་མེ་ཞི་བར་གྱུར་ནས།
en: No sooner had the Blessed One spoken these words than the fire subsided.

source: ཚོང་པ་དེ་དག་བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏོ། །
en: The merchants felt a surge of joy toward the Blessed One,

source: དགའ་བར་གྱུར་ནས། ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་དོ། །
en: and in their joy they sat before the Blessed One to listen to the Dharma.

source: དེ་ནས་དེ་དག་གི་ནང་ནས་ཁ་ཅིག་གིས་ནི་དྲོ་བར་གྱུར་པ་བསྐྱེད་དོ། །
en: and among the assembled some generated heat.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་ཞུགས་ཀྱིས་ཚིག་པར་གྱུར་པ་ལས་ཐར་བར་མཛད་ནས། གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་པ་ལ་གཟིགས།
en: “Lord,” the monks requested of the Blessed One, “tell us why the Blessed One saved many from perishing in the fire and established them in the unsurpassed, supreme welfare of nirvāṇa.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་ངས་དུད་འགྲོ་ཕལ་ཆེར་མེའི་འཇིགས་པ་ལས་བསྐྱབས་ནས་ཇི་ལྟར་འཇིགས་པ་མེད་པའི་གནས་སུ་བཀོད་པ་དེ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well and in the same way, I saved many animals from perishing in a fire and delivered them to safety. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། ནགས་ཁྲོད་ཅིག་ན་བྱ་ཕལ་ཆེར་གནས་སོ། །
en: “Monks, in times gone by, in a certain forest there lived a great number of birds.

source: དེ་ནས་ནགས་ཁྲོད་དེར་ཤིང་སྐམ་པོ་གཅིག་ལ་གཅིག་དྲུད་པ་ལས་མེ་བྱུང་ནས།
en: In that forest two dry sticks scraped against one another and a fire arose.

source: བྱ་དེ་དག་གི་ནང་ནས་འགྲོ་ནུས་པ་དེ་དག་ནི་དོང་ངོ་། །
en: Those birds that were able to, fled.

source: འགྲོ་མི་ནུས་པ་དང་། སྒོ་ང་རྣམས་ནི་དེ་ཉིད་དུ་བོར་རོ། །
en: Their eggs, and those birds that were not able to flee, were left behind.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་གོང་མ་སྲེག་ཏུ་སྐྱེ་བ་ཞིག་ཡོད་དེ།
en: “At that time there was a bodhisattva who had taken birth as a partridge,

source: བྱང་ཆུབ་སེམས་དཔའ་དེས་ཐག་རིང་པོ་ཞིག་ནས་མེ་འབར་ཞིང་འོང་བ་མཐོང་ངོ་། །
en: and from a distance the bodhisattva saw the approach of the blazing fire.

source: མཐོང་ནས་ཀྱང་དེ་སེམས་ཅན་དེ་དག་ལ་སྙིང་རྗེ་སྐྱེས་ཏེ།
en: He felt compassion for those living beings and thought,

source: བདག་གིས་སེམས་ཅན་སྡུག་བསྔལ་དང་ཕྲད་པ་འདི་རྣམས་ཀྱི་ཕྱིར་ཡང་བརྩོན་འགྲུས་མ་བསྐྱེད་ན་བདག་གིས་སེམས་ཅན་རྣམས་འཁོར་བ་ལས་ཇི་ལྟར་བསྒྲལ་བར་བྱ་སྙམ་དུ་བསམས་ནས།
en: ‘If I make no effort to deliver these beings as they face suffering, how can I lead them from saṃsāra?’

source: བྱང་ཆུབ་སེམས་དཔའ་དེས་འདབ་མ་ཆུར་སྤངས་ནས། མེ་ཆེན་པོའི་སྟེང་གི་ནམ་མཁའ་ལ་འདུག་སྟེ། འདབ་མ་སྤྲུགས་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: So the bodhisattva wet his wings with water, and as he circled in the sky above the great fire, he shook his wings and said in verse:

source: འདི་དག་འདབ་མ་ཡོད་མོད་ཀྱིས། །འདི་དག་ད་དུང་འཕུར་མི་ནུས། །
en: “ ‘Though they have wings They cannot fly.

source: འདི་དག་རྐང་པ་ཡོད་མོད་ཀྱིས། །འདི་དག་ད་དུང་འགྲོ་མི་ནུས། །
en: Though they have feet They cannot run.

source: འདི་རྣམས་ཕ་མ་འཕུར་ཏེ་སོང་། །
en: “ ‘Their parents, flown away, are gone.

source: མེ་ཁྱོད་སྡོད་ལ་མ་འགུལ་ཞིག །
en: Stay put, fire. Stir not.

source: བདེན་དང་བདེན་ཚིག་གང་ཡིན་པ། །བདག་གིས་བྱམས་སེམས་རབ་བསྒོམས་པའི། །བདེན་པའི་ཚིག་ནི་འདི་ཡིས་ན། །མེ་ཁྱོད་སྡོད་ལ་མ་འགུལ་ཞིག །
en: “ ‘If it is true and a true statement That I have perfectly Cultivated kindness, Then stay put, fire. Stir not.’

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་གྱི་དོན་གྱི་ཕྱིར་མི་དགའ་ཞིང་འདུག་པ་མཐོང་ངོ་། །
en: “Then Śakra, King of the Gods, saw that the bodhisattva was disheartened and remained there for the benefit of beings.

source: འདི་ནི་བསྐལ་པ་བཟང་པོའི་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་ཏེ། སེམས་ཅན་ལ་ཕན་པའི་ཕྱིར་མི་དགའ་ཞིང་འདུག་གིས།
en: ‘This is the bodhisattva of our own fortunate eon, who is disheartened and remains there for the benefit of beings.

source: མ་ལ་བདག་གིས་གྲོགས་བྱའོ་སྙམ་ནས།
en: I will help him!’

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཆར་མོ་ཆེ་ཕབ་སྟེ། མེ་དེ་ཞི་བར་གྱུར་ནས་སེམས་ཅན་དེ་དག་ཐམས་ཅད་མེའི་འཇིགས་པ་ལས་ཐར་བར་གྱུར་ཏོ། །
en: Then Śakra, King of the Gods, let fall a great rain to quell the fire, and rescued all the beings from the threat of fire.

source: དེའི་ཚེ་བྱ་གོང་མ་སྲེག་ཏུ་གྱུར་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ནོ། །
en: I am the one who was the partridge then and lived the life of a bodhisattva.

source: དེའི་ཚེ་ནགས་ཁྲོད་དེ་ན་གནས་པའི་སེམས་ཅན་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི་སྐྱེ་བོ་ཕལ་པོ་ཆེ་འདི་དག་ཁོ་ན་ཡིན་ཏེ།
en: Those who were the beings of the forest then are none other than these many persons.

source: དེའི་ཚེ་ཡང་ངས་དེ་དག་མེའི་འཇིགས་པ་ལས་ཐར་བར་བྱས་ཏེ། འཇིགས་པ་མེད་པའི་གནས་སུ་བཀོད་དོ། །
en: At that time I rescued them from the threat of fire and delivered them to safety.

source: ད་ལྟར་ཡང་ངས་མེའི་འཇིགས་པ་ལས་ཐར་བར་བྱས་ནས།
en: Now as well I have rescued them from the threat of fire

source: གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་། བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་དོ། །
en: and established them in the unsurpassed, supreme welfare of nirvāṇa.

source: གཞན་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ།
en: “They also went forth in the teaching of the totally and completely awakened Buddha Kāśyapa.

source: འདི་དག་ཐམས་ཅད་ཁ་ཅིག་ནི་རབ་ཏུ་བྱུང་ངོ་། །
en: Some became monks.

source: ཁ་ཅིག་ནི་དགེ་བསྙེན་དུ་གྱུར་ཏེ།
en: Some became lay vow holders.

source: དེར་འདི་རྣམས་ཀྱིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པའི་གནས་བསྲུངས་ནས། དབང་པོ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེས་ནི་ད་ལྟར་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ།། །།
en: After practicing pure conduct all their lives then, their faculties ripened, and now they have been liberated.”

source: ཕ་ཞེས་བྱ་བ་ནི།
en: Father, or The Story of Sudarśana

source: གླེང་གཞི་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་ཏེ།
en: When the Blessed One was in Rājagṛha, there lived a certain householder named Dhanika.

source: དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་ན་ཁྱིམ་བདག་ནོར་ཅན་ཞེས་བྱ་བ་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ། ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་མཉམ་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་དེས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས
en: He was prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s. When the time came for him to marry he took a wife,

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་མདོག་བཟང་བ།
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful,

source: གསེར་གྱི་ཁ་དོག་ཅན་མགོ་བོ་གདུགས་ལྟར་འདུག་པ་ལག་པ་རིང་བ། དཔྲལ་བའི་དབྱེས་ཆེ་བ། སྣ་མཐོ་བ། སྣ་ལེགས་པ། སྨིན་མ་སྟུག་པ་ཞིག་བཙས་ཏེ
en: with glowing, golden skin and a well-rounded head, long arms, a broad brow, a fine and prominent nose, and eyebrows that met.

source: ཁྱེའུ་དེ་བཙས་མ་ཐག་ཏུ་སྐྱེ་བོ་ཕལ་པོ་ཆེས་བལྟ་ན་སྡུག་པར་གྱུར་ཏོ། །
en: When the great crowd of people saw him just after he was born he was beautiful.

source: དེ་ནས་དེའི་ཚེ་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས།
en: At the elaborate feast celebrating his birth they asked,

source: ཁྱེའུ་འདི་བཙས་མ་ཐག་ཏུ་སྐྱེ་བོ་ཕལ་པོ་ཆེས་བལྟས་ན་སྡུག་པར་གྱུར་པས་ན། དེའི་ཕྱིར་ཁྱེའུ་འདིའི་མིང་བལྟ་ན་སྡུག་ཅེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: “Since when the great crowd of people saw him just after his birth he was beautiful, his name will be Sudarśana.”

source: དེ་ནས་ཁྱེའུ་བལྟ་ན་སྡུག །འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་། མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ནས།
en: They reared young Sudarśana on milk, yogurt, butter, ghee, and milk solids,

source: རྒྱལ་པོའི་ཁབ་ཐམས་ཅད་དུ་དེའི་གྲགས་པ་རྒྱས་པར་གྱུར་ཏོ། །
en: and his fame spread throughout Rājagṛha.

source: དེ་ནས་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་བླ་ན་མེད་པའི་ཡེ་ཤེས་བརྙེས་ནས་མཐར་གྱིས་གདུལ་བར་བྱ་བའི་དོན་མཛད་ཅིང་། རྒྱལ་པོའི་ཁབ་ཏུ་བྱོན་པ་དེའི་ཚེ། དེར་བཅོམ་ལྡན་འདས་ཀྱིས་འོད་མའི་ཚལ་གཞེས་ནས།
en: After the Blessed One achieved unexcelled wisdom he began to act for the benefit of those to be tamed and came to Rājagṛha. He stayed in Bamboo Grove,

source: སེམས་ཅན་སྟོང་ཕྲག་དུ་མ་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་ལ་བཀོད་དོ། །
en: where he inspired thousands to go for refuge and take the fundamental precepts.

source: སྐྱེ་བོ་མང་པོ་དེ་དག་ཀྱང་སྡེ་ཚན་ནས་སྡེ་ཚན་དང་། ཕ་ཚན་ནས་ཕ་ཚན་དང་། དགའ་སྡེ་ནས་དགའ་སྡེར་དུས་དུས་སུ་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འདོང་བར་བྱེད་དོ། །
en: From time to time, group after group and elder after elder, one joyful group after another, gathered and went to see the Blessed One.

source: ཕྱིན་ཅད་ཁྱེའུ་དེ་བལྟ་བའི་ཕྱིར་འདོང་བར་མི་བྱེད་དོ། །
en: No one came to see young Sudarśana anymore,

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱེའུ་བལྟ་ན་སྡུག་གིས་དྲིས་པ།
en: so one day he asked his parents,

source: སྔོན་ཅད་ནི་སྐྱེ་བོ་མང་པོ་འདི་དག་ང་བལྟ་བའི་ཕྱིར་འོང་ན། ད་ནི་ང་བལྟ་བའི་ཕྱིར་མི་འོང་བ་ཅི་ལས་གྱུར།
en: “Why is it that many people came to see me before, but no one comes to see me now?”

source: དེ་དག་གིས་སྨྲས་པ། དེ་དག་ནི་ད་ལྟར་བཅོམ་ལྡན་འདས་བལྟ་བའི་ཕྱིར་འདོང་བར་བྱེད་དོ། །
en: “Now they go to see the Blessed One,” they replied.

source: ཁྱེའུས་སྨྲས་པ། བཅོམ་ལྡན་འདས་ཞེས་བྱ་བ་དེ་ལྟ་བུ་སུ་ཞིག །
en: “Who is this Blessed One?” asked the young man.

source: དེ་ནས་ཕ་མ་གཉིས་ཀྱིས་དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱི་བསྔགས་པ་རྒྱས་པར་བརྗོད་དོ། །
en: His parents praised the Blessed One,

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཁྱེའུ་དེ་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: and as soon as he heard this, he was filled with wonder and thought,

source: བདག་བས་ཆེས་བལྟ་ན་སྡུག་པ་དེ་ཇི་ལྟ་བུ་ཞིག་སྙམ་ནས།
en: “How could he be more pleasing to the eye than I?”

source: ཕ་མ་གཉིས་ལ་སྨྲས་པ།
en: Then he said to his parents,

source: ཡབ་ཡུམ་བདག་བཅོམ་ལྡན་འདས་དེ་བལྟ་བའི་སླད་དུ་མཆི་བར་འཚལ་ལོ། །
en: “Mother, Father, I wish to go see the Blessed One.”

source: ཕ་མ་གཉིས་ཀྱིས་སྨྲས་པ། བུ་ཐབས་ཅིག་ཏུ་འདོང་ངོ་ཞེས་སྨྲས་ནས།
en: “Child, we’ll go with you,” his parents replied.

source: ཕ་མ་གཉིས་ཀྱིས་ཁྱེའུ་དེ་ཁྲིད་དེ། འོད་མའི་ཚལ་དུ་སོང་ནས།
en: The parents took their child to Bamboo Grove,

source: མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་མཆོག་ཏུ་དགའ་བ་སྐྱེས་ནས་
en: When he saw the Blessed Buddha the sight of him filled him with supreme joy,

source: དེ་ལ་ཕའི་འདུ་ཤེས་ཀྱང་བྱུང་སྟེ།
en: and he believed himself to be looking at his father.

source: དེས་ཕ་ཕ་ཞེས་སྒྲ་ཕྱུང་སྟེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་
en: He cried out, “Father! Father!” and approached the Blessed One.

source: ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Upon his arrival he touched his head to the feet of the Blessed One, and,

source: ཕ་ཙམ་དུ་འཛིན་ཅིང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་དྲུང་དུ་འདུག་གོ། །
en: believing the Blessed One to be his father, sat at the Blessed One’s feet.

source: དེའི་ཕ་མ་གཉིས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: His parents likewise touched their heads to the feet of the Blessed One and sat before him to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་གི་རྐྱེན་དུ་འཚམ་པའི་ཆོས་བསྟན་ནས་ཅང་མི་གསུང་བར་བཞུགས་སོ། །
en: The Blessed One taught them the Dharma particularly suited to their condition, then sat without speaking.

source: དེ་ནས་ཁྱིམ་བདག་ནོར་ཅན་དང་། དེའི་ཆུང་མས་བཅོམ་ལྡན་འདས་ཀྱི་གཏམ་མཇུག་རྫོགས་པར་རིག་ནས། ཁྱེའུའི་ལག་པ་ནས་བཟུང་སྟེ་འགྲོའོ་ཞེས་བྱས་ན།
en: Knowing that the Blessed One had completed his discourse, the householder Dhanika and his wife then took their son by the hand and prepared to depart, saying, “We are going to go now.”

source: ཁྱེའུ་དེ་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་དབྲལ་བར་མ་ནུས་སོ། །
en: But the young man could not be parted from the Blessed One.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་གི་ཁྱིམ་དུ་སྤྱན་དྲངས་དང་། ཐབས་དེས་ན་འདི་བདག་གིས་ཁྱིམ་དུ་དཀྲིད་ནུས་པར་འགྱུར་རོ་སྙམ་ནས།
en: “We can get him home by inviting the Blessed One to our house.”

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: They bowed toward the Blessed One with palms pressed together and requested the Blessed One,

source: དགུང་བདུན་གྱི་བར་དུ་བཅོམ་ལྡན་འདས་བདག་ཅག་གི་ཁྱིམ་དུ་བཤོས་གསོལ་བར་ཅི་གནང་ཞེས་བྱས་སོ། །
en: “Please permit us to invite the Blessed One to take a meal at our house for seven days,”

source: དེ་ནས་ཁྱིམ་བདག་དེས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས། ཆུང་མ་ལ་སྨྲས་པ།
en: Understanding that by his silence the Blessed One had given his assent, the householder said to his wife,

source: བཟང་མོ་སོང་ལ་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་ཟས་སྟ་གོན་གྱིས་ཤིག །
en: “Sweet one, go and prepare food for the Blessed One.

source: བདག་ནི་ཁྱེའུ་དང་ལྷན་ཅིག་ཏུ་འདུག་གོ་ཞེས་བྱས་ནས།
en: The boy and I shall stay with the Blessed One here.”

source: ཁྱིམ་བདག་ནི་ཁྱེའུ་དེ་དང་ལྷན་ཅིག་ཏུ་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་མཚན་མོ་དགོངས་མལ་བཏབ་བོ། །
en: The householder and his child slept that night in Bamboo Grove.

source: ཆུང་མས་ཀྱང་དེ་ཉིད་ཀྱི་མཚན་མོ་བཟའ་བ་དང་། བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་སྦྱར་ནསནང་པར་སྔར་ལངས་ཏེ་གདན་བཤམས་ནས། ཆུ་ར་བཀང་སྟེ་བཞག་ནས།
en: After preparing many good, wholesome foods that night, in the morning the woman rose, prepared seats, filled the water pots, and set them out.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ད་དེའི་དུས་ལ་བབ་པར་དགོངས་ཏེ་གཤེགས་སུ་གསོལ་ཞེས་བསྐུལ་ཏེ།
en: Know that the time has come, Blessed One, and your presence is requested.”

source: ལྷུང་བཟེད་བསྣམས་ནས། དགེ་སློང་མང་པོས་ཞམ་རིང་བྱས་ཏེ། དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ནས།
en: carrying his alms bowl, he set out surrounded and attended by an assembly of monks.

source: ཁྱིམ་བདག་དེའི་བཀད་ས་ག་ལ་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས། བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ལ་བཞུགས་སོ། །
en: They arrived at the householders’ reception room, where the Blessed One took his place on the seat prepared for him amid the saṅgha of monks.

source: དེ་ནས་ཁྱིམ་བདག་དེས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་བདེ་བར་བཞུགས་པར་རིག་ནས། རང་གི་ལག་ནས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ཏེ།
en: Once the householder knew that the Buddha and the rest of the saṅgha of monks were comfortably seated, by his own hand he contented them with many good, wholesome foods, proffering all that they wished.

source: ཅི་བཞེད་པ་བསྟབས་ནས། བཅོམ་ལྡན་འདས་བཤོས་གསོལ་ཟིན་ཏེ། བསྩང་སྡེར་ནི་གྱུ་ཕྱག་ནི་བཅབས་པར་རིག་ནས། སྟན་ཆེས་དམའ་བ་ཞིག་བླངས་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་འཁོར་དང་བཅས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་དོ། །
en: Once he knew that the Blessed One had finished eating and that his bowl had been taken away and his hands washed, he brought in a very low seat and sat before the Blessed One and his suite of attendants to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་གི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། ཤེས་པ་དང་། རང་བཞིན་ཐུགས་སུ་ཆུད་ནས། དེ་དག་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended their thoughts, habitual tendencies, temperaments, capacities, and natures, and taught them the Dharma accordingly.

source: དེས་ན་ཁྱིམ་བདག་དེ་འཁོར་དང་བཅས་པས། སྟན་དེ་དག་ཉིད་ལ་འཁོད་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་སོ། །
en: Hearing it, the householder and his retinue destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: དེ་ལྟར་བདེན་པ་མཐོང་ནས། ཁྱེའུ་དེས་ཕ་མ་གཉིས་ལ་གསོལ་ཏེ།
en: After seeing the truths, the child asked for his parents’ permission,

source: བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་། བསྙེན་པར་རྫོགས་ཤིང་། དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན།
en: “Lord, if permitted I wish to go forth in the Dharma and Vinaya so well spoken, complete my novitiate, and achieve full ordination.

source: དེས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་། འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Casting away all afflictive emotions through diligence, practice, and effort, he manifested arhatship.

source: ཙན་དན་སྦངས་པ་ལྟ་བུར་བསིལ་བར་གྱུར་པ་མ་རིག་པའི་སྒོ་ངའི་སྦུབས་བཅོམ་པ་རིག་པ་དང་མངོན་པར་ཤེས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ་སྲིད་པའི་རྙེད་པ་དང་ཆགས་པ་དང་བཀུར་སྟི་ལ་མི་ལྟ་བ་དབང་པོ་དང་།
en: He became cool like wet sandalwood. His insight crushed ignorance like an eggshell. He achieved the insights, superknowledges, and discriminations. He had no regard for worldly profit, passion, or acclaim.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བྱིས་པ་སྟོང་ཕྲག་དུ་མས་མཐོང་ཡང་སུ་ཡང་འདི་ཁོ་ན་ལྟར་བཅོམ་ལྡན་འདས་ལ་མཇལ་བར་མི་བགྱིད་ལགས་སོ། །
en: “Lord, thousands of children have seen the Blessed One, but never has anyone encountered him quite like that.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཁྱེའུ་འདི་ནི་ངའི་འདས་མ་ཐག་པའི་ཚེ་རབས་ལྔ་བརྒྱར་བུར་གྱུར་པས་ན།
en: “Monks,” the Blessed One explained, “for five hundred lifetimes this young man was my child.

source: སྔོན་གྱི་བག་ཆགས་དེ་ཁོ་ནས་འདིས་ང་ལ་མཇལ་བར་བྱེད་དོ། །
en: It was on the basis of these habitual tendencies that he encountered me so.”

source: གསོལ་པ། ཁྱེའུ་འདིས་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ།
en: “Lord,” they inquired, “what action did the young man take that ripened into his birth into a family of great means, prosperity, and wealth;

source: འདི་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པར་གྱུར་ལ།
en: that he was well proportioned, pleasing to the eye, and beautiful;

source: འདིས་བཅོམ་ལྡན་འདས་ཀྱང་མཉེས་པར་བགྱིས་ནས། མི་མཉེས་པར་མི་བགྱིས་ཏེ།
en: and that he pleased the Blessed One, did not displease him,

source: གསོལ་པ་བཙུན་པ་འདིས་སྨོན་ལམ་གང་དུ་བཏབ་ལགས།
en: “Lord, where did he make these prayers?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་བཞི་ཁྲི་ཐུབ་པ་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཁོར་བ་འཇིག་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks,” the Blessed One recounted, “in times past, in this fortunate eon, when people lived as long as forty thousand years, and the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Krakucchanda was in the world,

source: དེར་གང་གི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་གིས། བླ་ན་མེད་པའི་ཡེ་ཤེས་བརྙེས་ནས། རྒྱལ་པོའི་ཕོ་བྲང་མཛེས་ལྡན་དུ་གཤེགས་པ་
en: the totally and the completely awakened Buddha Krakucchanda achieved unexcelled wisdom and then traveled to the royal palace known as Śobhāvatī.

source: དེའི་ཚེ། རྒྱལ་པོ་མཛེས་པས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་གི་ཕྱིར། གཙུག་ལག་ཁང་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་ཞིག་བྱས་ནསཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་ལ་ཕུལ་ལོ། །
en: At that time, King Śobha had built a monastery for the totally and completely awakened Buddha Krakucchanda that was complete in every respect, and offered it to the totally and completely awakened Buddha Krakucchanda.

source: རྒྱལ་པོ་མཛེས་པ་དེའི་ལུགས་ཀྱིས་ན། ཉིན་གཅིག་བཞིན་དུ་འཁོར་དང་བཅས་ཏེ། གཙུག་ལག་ཁང་དུ་འགྲོ་ཞིང་གཙུག་ལག་ཁང་གི་བྱི་དོར་བྱེད་དོ། །
en: It was King Śobha’s custom to go to the monastery every day with a suite of attendants and sweep.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་མཛེས་པ་དེ་གཙུག་ལག་ཁང་དུ་སོང་བ་ལས་བྱ་བ་ཞིག་བྱུང་ནས་དེས་བུ་ཐུ་བོ་བསྐོས་ཏེ།
en: One day as King Śobha was headed to the monastery, some work came up, so the king instructed his eldest son,

source: དེང་ཁྱོད་ཀྱིས་གཙུག་ཁང་གི་བྱི་དོར་གྱིས་ཤིག་ཅེས་བསྒོ་ནས་རྒྱལ་པོ་སོང་ངོ་། །
en: “Go and sweep the monastery today,” and departed.

source: དེ་ནས་རྒྱལ་པོའི་བུ་འཁོར་དང་བཅས་པ་གཙུག་ལག་ཁང་གི་བྱི་དོར་བྱེད་པ་ལ་ཞུགས་པ་ལས། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་བ་འཇིག་གིས་ཅི་ནས་རྒྱལ་པོའི་བུ་དེ་ཉི་མ་ནུབ་ཀྱི་བར་དུ་ཡང་། གཙུག་ལག་ཁང་གི་བྱི་དོར་བྱེད་མི་ནུས་པ་དེ་ལྟ་བུར་བྱིན་གྱིས་བརླབས་ནས། དེ་གཙུག་ལག་ཁང་དེ་ཉིད་དུ་དགོངས་མལ་བཏབ་བོ། །
en: As the prince and the suite of attendants went to sweep the monastery, the totally and completely awakened Buddha Krakucchanda performed a miracle so that no matter what he did, the prince would not be able to finish sweeping the monastery before nightfall and would bed down there for the night.

source: དེས་དེར་དགོངས་མལ་བཏབ་ནས། དགེ་སློང་རྣམས་ཆོ་འཕྲུལ་དག་བྱེད་པ་ཡང་མཐོང་།
en: As he was bedding down for the night, the prince saw miraculous displays performed by the monks,

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་ལ་སོགས་པ་འོང་བ་ཡང་མཐོང་ངོ་། །
en: and he saw that Śakra and Brahmā and the rest had come.

source: དེ་ནས་དེ་མཐོང་མ་ཐག་ཏུ་དེ་བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ནས།
en: As soon as he saw them he experienced a surge of joy toward the Blessed One,

source: གཙུག་ཁང་དེ་ཉིད་ན་དགེ་སློང་དག་གི་རིམ་གྲོ་བྱེད་པ་ལ་བརྩོན་པར་གྱུར་ཏེ།
en: and began putting great effort into serving the monks there in the monastery.
